-- MySQL dump 10.13  Distrib 5.7.9, for Win64 (x86_64)
--
-- Host: localhost    Database: ele
-- ------------------------------------------------------
-- Server version	5.7.13-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `cities`
--

DROP TABLE IF EXISTS `cities`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cities` (
  `citycode` char(7) NOT NULL,
  `cityname` varchar(26) DEFAULT NULL,
  PRIMARY KEY (`citycode`),
  UNIQUE KEY `citycode_UNIQUE` (`citycode`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cities`
--

LOCK TABLES `cities` WRITE;
/*!40000 ALTER TABLE `cities` DISABLE KEYS */;
INSERT INTO `cities` VALUES ('010','北京市'),('020','广州市'),('021','上海市'),('022','天津市'),('023','重庆市'),('024','沈阳市'),('025','南京市'),('027','武汉市'),('028','成都市'),('029','西安市'),('0310','邯郸市'),('0311','石家庄市'),('0312','保定市'),('0313','张家口市'),('0314','承德市'),('0315','唐山市'),('0316','廊坊市'),('0317','沧州市'),('0318','衡水市'),('0319','邢台市'),('0335','秦皇岛市'),('0349','朔州市'),('0350','忻州市'),('0351','太原市'),('0352','大同市'),('0353','阳泉市'),('0354','晋中市'),('0355','长治市'),('0356','晋城市'),('0357','临汾市'),('0358','吕梁市'),('0359','运城市'),('0370','商丘市'),('0371','郑州市'),('0372','安阳市'),('0373','新乡市'),('0374','许昌市'),('0375','平顶山市'),('0376','信阳市'),('0377','南阳市'),('0378','开封市'),('0379','洛阳市'),('0391','焦作市'),('0392','鹤壁市'),('0393','濮阳市'),('0394','周口市'),('0395','漯河市'),('0396','驻马店市'),('0398','三门峡市'),('0410','铁岭市'),('0411','大连市'),('0412','鞍山市'),('0413','抚顺市'),('0414','本溪市'),('0415','丹东市'),('0416','锦州市'),('0417','营口市'),('0418','阜新市'),('0419','辽阳市'),('0421','朝阳市'),('0427','盘锦市'),('0429','葫芦岛市'),('0431','长春市'),('0432','吉林市'),('0434','四平市'),('0435','通化市'),('0436','白城市'),('0437','辽源市'),('0438','松原市'),('0439','白山市'),('0451','哈尔滨市'),('0452','齐齐哈尔市'),('0453','牡丹江市'),('0454','佳木斯市'),('0455','绥化市'),('0456','黑河市'),('0457','大兴安岭地区'),('0458','伊春市'),('0459','大庆市'),('0464','七台河市'),('0467','鸡西市'),('0468','鹤岗市'),('0469','双鸭山市'),('0470','呼伦贝尔市'),('0471','呼和浩特市'),('0472','包头市'),('0473','乌海市'),('0474','乌兰察布市'),('0475','通辽市'),('0476','赤峰市'),('0477','鄂尔多斯市'),('0478','巴彦淖尔市'),('0479','锡林郭勒盟'),('0482','兴安盟'),('0483','阿拉善盟'),('0510','无锡市'),('0511','镇江市'),('0512','苏州市'),('0513','南通市'),('0514','扬州市'),('0515','盐城市'),('0516','徐州市'),('0517','淮安市'),('0518','连云港市'),('0519','常州市'),('0523','泰州市'),('0527','宿迁市'),('0530','菏泽市'),('0531','济南市'),('0532','青岛市'),('0533','淄博市'),('0534','德州市'),('0535','烟台市'),('0536','潍坊市'),('0537','济宁市'),('0538','泰安市'),('0539','临沂市'),('0543','滨州市'),('0546','东营市'),('0550','滁州市'),('0551','合肥市'),('0552','蚌埠市'),('0553','芜湖市'),('0554','淮南市'),('0555','马鞍山市'),('0556','安庆市'),('0557','宿州市'),('0558','亳州市'),('0559','黄山市'),('0561','淮北市'),('0562','铜陵市'),('0563','宣城市'),('0564','六安市'),('0566','池州市'),('0570','衢州市'),('0571','杭州市'),('0572','湖州市'),('0573','嘉兴市'),('0574','宁波市'),('0575','绍兴市'),('0576','台州市'),('0577','温州市'),('0578','丽水市'),('0579','金华市'),('0580','舟山市'),('0591','福州市'),('0592','厦门市'),('0593','宁德市'),('0594','莆田市'),('0595','泉州市'),('0596','漳州市'),('0597','龙岩市'),('0598','三明市'),('0599','南平市'),('0631','威海市'),('0632','枣庄市'),('0633','日照市'),('0634','莱芜市'),('0635','聊城市'),('0660','汕尾市'),('0662','阳江市'),('0663','揭阳市'),('0668','茂名市'),('0691','西双版纳傣族自治州'),('0692','德宏傣族景颇族自治州'),('0701','鹰潭市'),('0710','襄阳市'),('0711','鄂州市'),('0712','孝感市'),('0713','黄冈市'),('0714','黄石市'),('0715','咸宁市'),('0716','荆州市'),('0717','宜昌市'),('0718','恩施土家族苗族自治州'),('0719','十堰市'),('0722','随州市'),('0724','荆门市'),('0728','仙桃市'),('0730','岳阳市'),('0731','长沙市'),('0732','湘潭市'),('0733','株洲市'),('0734','衡阳市'),('0735','郴州市'),('0736','常德市'),('0737','益阳市'),('0738','娄底市'),('0739','邵阳市'),('0743','湘西土家族苗族自治州'),('0744','张家界市'),('0745','怀化市'),('0746','永州市'),('0750','江门市'),('0751','韶关市'),('0752','惠州市'),('0753','梅州市'),('0754','汕头市'),('0755','深圳市'),('0756','珠海市'),('0757','佛山市'),('0758','肇庆市'),('0759','湛江市'),('0760','中山市'),('0762','河源市'),('0763','清远市'),('0766','云浮市'),('0768','潮州市'),('0769','东莞市'),('0770','防城港市'),('0771','南宁市'),('0772','柳州市'),('0773','桂林市'),('0774','梧州市'),('0775','玉林市'),('0776','百色市'),('0777','钦州市'),('0778','河池市'),('0779','北海市'),('0790','新余市'),('0791','南昌市'),('0792','九江市'),('0793','上饶市'),('0794','抚州市'),('0795','宜春市'),('0796','吉安市'),('0797','赣州市'),('0798','景德镇市'),('0799','萍乡市'),('0801','保亭黎族苗族自治县'),('0802','白沙黎族自治县'),('0803','昌江黎族自治县'),('0804','澄迈县'),('0805','儋州市'),('0806','定安县'),('0807','东方市'),('0809','陵水黎族自治县'),('0812','攀枝花市'),('0813','自贡市'),('0816','绵阳市'),('0817','南充市'),('0818','达州市'),('0825','遂宁市'),('0826','广安市'),('0827','巴中市'),('0830','泸州市'),('0831','宜宾市'),('0832','资阳市'),('0833','乐山市'),('0834','凉山彝族自治州'),('0835','雅安市'),('0836','甘孜藏族自治州'),('0837','阿坝藏族羌族自治州'),('0838','德阳市'),('0839','广元市'),('0851','贵阳市'),('0852','遵义市'),('0853','安顺市'),('0854','黔南布依族苗族自治州'),('0855','黔东南苗族侗族自治州'),('0856','铜仁市'),('0857','毕节市'),('0858','六盘水市'),('0859','黔西南布依族苗族自治州'),('0870','昭通市'),('0871','昆明市'),('0872','大理白族自治州'),('0873','红河哈尼族彝族自治州'),('0874','曲靖市'),('0875','保山市'),('0876','文山壮族苗族自治州'),('0877','玉溪市'),('0878','楚雄彝族自治州'),('0879','普洱市'),('0883','临沧市'),('0886','怒江傈僳族自治州'),('0887','迪庆藏族自治州'),('0888','丽江市'),('0891','拉萨市'),('0892','日喀则市'),('0893','山南地区'),('0894','林芝市'),('0895','昌都市'),('0896','那曲地区'),('0897','阿里地区'),('0898','海口市'),('0899','三亚市'),('0901','塔城地区'),('0902','哈密地区'),('0903','和田地区'),('0906','阿勒泰地区'),('0908','克孜勒苏柯尔克孜自治州'),('0909','博尔塔拉蒙古自治州'),('0910','咸阳市'),('0911','延安市'),('0912','榆林市'),('0913','渭南市'),('0914','商洛市'),('0915','安康市'),('0916','汉中市'),('0917','宝鸡市'),('0919','铜川市'),('0930','临夏回族自治州'),('0931','兰州市'),('0932','定西市'),('0933','平凉市'),('0934','庆阳市'),('0935','金昌市'),('0936','张掖市'),('0937','酒泉市'),('0938','天水市'),('0941','甘南藏族自治州'),('0943','白银市'),('0951','银川市'),('0952','石嘴山市'),('0953','吴忠市'),('0954','固原市'),('0970','海北藏族自治州'),('0971','西宁市'),('0972','海东市'),('0973','黄南藏族自治州'),('0974','海南藏族自治州'),('0975','果洛藏族自治州'),('0976','玉树藏族自治州'),('0977','海西蒙古族藏族自治州'),('0990','克拉玛依市'),('0991','乌鲁木齐市'),('0993','石河子市'),('0994','昌吉回族自治州'),('0995','吐鲁番市'),('0996','巴音郭楞蒙古自治州'),('0997','阿克苏地区'),('0998','喀什地区'),('0999','伊犁哈萨克自治州'),('1391','济源市'),('1433','延边朝鲜族自治州'),('1558','阜阳市'),('1719','神农架林区'),('1728','天门市'),('1755','贵港市'),('1771','崇左市'),('1772','来宾市'),('1774','贺州市'),('1832','内江市'),('1833','眉山市'),('1852','香港特別行政區'),('1853','澳門特別行政區'),('1886','台湾省'),('1891','南沙群岛'),('1892','屯昌县'),('1893','文昌市'),('1894','琼海市'),('1895','西沙群岛'),('1896','临高县'),('1897','五指山市'),('1898','万宁市'),('1899','琼中黎族苗族自治县'),('1900','外國'),('1906','北屯市'),('1909','双河市'),('1935','武威市'),('1937','嘉峪关市'),('1953','中卫市'),('1994','五家渠市'),('1996','铁门关市'),('1997','阿拉尔市'),('1998','图木舒克市'),('1999','可克达拉市'),('2728','潜江市'),('2801','中沙群岛的岛礁及其海域'),('2802','乐东黎族自治县'),('2898','三沙市'),('2935','陇南市');
/*!40000 ALTER TABLE `cities` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-06-17 16:08:29
